# Aufgabenblatt 3

<u> Praktikumsgruppe 1

**Aufgabe 1a:**

Was versteht man unter der Datenstruktur *Series* aus der *pandas*-Bibliothek? Geben Sie ein Beispiel an. 

Unter einer *Series* versteht man ein eindimensionales, Array-artiges Objekt. Es besteht aus einer Sequenz aus Werte, die vom Typ vergleichbar mit NumPy-Typen sind. Es enthält damit ein verbundenes Array aus Markierungen und Labels (sog. *Index*). Die einfachste Series stellt ein Array aus Daten dar: 

<u>Beispiel:

In [33]:
import pandas as pd

series1 = pd.Series([1, 2, 3, -4, 6])
series1

0    1
1    2
2    3
3   -4
4    6
dtype: int64

In [34]:
series2 = pd.Series([1, 2, 3, -4, 6], index = ['Anton', 'Berta', 'Gisela', 'Kurt', 'Bert'])
series2

Anton     1
Berta     2
Gisela    3
Kurt     -4
Bert      6
dtype: int64

**Aufgabe 1b:**

Erklären Sie die Datenstruktur *DataFrame* aus der *pandas*-Bibliothek. Geben Sie ein Beispiel an.

Ein *DataFrame* stellt eine Datentabelle rechteckiger Struktur dar, die eine geordnete Sammlung aus Spalten enthält. Diese können jeweils auf einem anderen Werttyp (numerisch, String, boolsch etc.) bestehen. In einem *DataFrame* gibt es sowohl einen *Zeilen-* als auch *Spaltenindex*. Gespeichert werden *DataFrames* als Blöcke (einer oder mehrere).

<u>Beispiel:

In [35]:
data = {'Student': ['Ida', 'Edda', 'Gerda', 'Fred', 'Wolf'],
      'Semester': [1, 3, 2, 5, 10], 
      'Notendurchschnitt': [1.3, 3.3, 2.7, 4.0, 4.0]}
df = pd.DataFrame(data)
df

  Student  Semester  Notendurchschnitt
0     Ida         1                1.3
1    Edda         3                3.3
2   Gerda         2                2.7
3    Fred         5                4.0
4    Wolf        10                4.0

**Aufgabe 1c:**

Was versteht man unter *Korrelation* bzw. *Korrelationskoeffizent* in der explorativen Statistik (explorative Datenanalyse - EDA)?

Die *Korrelation* ist ein Maß für die **Stärke** und **Richtung** des linearen Zusammenhangs zwischen zwei Variablen. Nicht-lineare Zusammenhänge (z.B. kurvenförmige Beziehungen) werden durch die herkömmliche *Korrelation* nicht abgebildet. 

- Die **Stärke** wird durch den *Korrelationskoeffizienten* ausgedrückt, der Werte zwischen -1 und +1 annehmen kann. 
- Die **Richtung** wird durch das Vorzeichen des *Korrelationskoeffizenten* angezeigt: 
    * (+): Wenn eine Variable ansteigt, steigt (tendentiell) auch die andere.
    * (-): Wenn eine Variable ansteigt, fällt (tendentiell) die andere.

*Korrelation* bedeutet dabei nicht Kausalität, es lässt sich daraus nicht ableiten, dass eine Variable eine andere verursacht. Die *Korrelation* dient vielmehr dazu, Muster und Zusammenhänge in Daten zu erkennen. Sie hilft, Hypothesen zu generieren und weitere Untersuchungen anzustoßen.

**Aufgabe 1d:**

Erklären Sie den Begriff *Kovarianz* aus der Diskriminanzanalyse (statistische Klassifikationsverfahren).

Die *Kovarianz* spielt eine wichtige Rolle in der Diskriminanzanalyse. Es stellt ein statistisches Maß dar, dass das Ausmaß bescheibt, in dem eine Variable in Abhängigkeit von einer anderen variiert. Die *Kovarianz* misst den (linearen) Zusammenhang zwischen zwei Variablen. Es zeigt dabei, **ob** und **wie stark** Variablen zusammenhängen.

- (+) Kovarianz: tendentiell steigen oder fallen beide Variablen gleichzeitig
- (-) Kovarianz: tendentiell steigt eine Variable, während die andere fällt (oder umgekehrt).

Während die Korrelation auf Werte zwischen -1 und 1 beschränkt ist, hängt die Skalierung der Kovarianz von der Skalierung der Variablen ab.

### Aufgabe_03_2.ipynb ###

In [38]:
# pandas-Bibliothek importieren
import pandas as pd

# pandas-Series fuer das Bundesland Hessen
sHessen = pd.Series([4.78, 6.07], index=[1960, 2000])

# 1960    4.78
# 2000    6.07
# dtype: float64

# Dictionary mit der Bevoelklerung anlegen
data = {'NRW':     {1960: 15.85, 2000: 18.00, 2020: 17.93},
        'Bayern':  {1960:  9.49, 2000: 12.23, 2020: 13.14},
        'Hamburg': {1960:  1.84, 2000:  1.72, 2020:  1.85}}

pandas-DataFrame aus dem Dictionary data erzeugen

In [2]:
frame = pd.DataFrame(data)
frame

        NRW  Bayern  Hamburg
1960  15.85    9.49     1.84
2000  18.00   12.23     1.72
2020  17.93   13.14     1.85

Namen für Zeilen und Spalten hinzufügen

In [3]:
frame.index.name = 'Jahr'; frame.columns.name = "Bundesland"
frame

Bundesland    NRW  Bayern  Hamburg
Jahr
1960        15.85    9.49     1.84
2000        18.00   12.23     1.72
2020        17.93   13.14     1.85

Ausgabe der Spalte 'Bayern'

In [4]:
frame['Bayern']
#frame.Bayern

Jahr
1960     9.49
2000    12.23
2020    13.14
Name: Bayern, dtype: float64

Ausgabe der Zeile 2000

In [5]:
frame.loc[2000]

Bundesland
NRW        18.00
Bayern     12.23
Hamburg     1.72
Name: 2000, dtype: float64

DataFrame um das Bundesland 'Hessen' erweitern

In [8]:
frame['Hessen'] = sHessen
frame

Bundesland    NRW  Bayern  Hamburg  Hessen
Jahr
1960        15.85    9.49     1.84    4.78
2000        18.00   12.23     1.72    6.07
2020        17.93   13.14     1.85     NaN

Alle NaN-Werte mit 0 füllen

In [23]:
dfData = frame.fillna(0) 
dfData

Bundesland    NRW  Bayern  Hamburg  Hessen
Jahr
1960        15.85    9.49     1.84    4.78
2000        18.00   12.23     1.72    6.07
2020        17.93   13.14     1.85    0.00

Absteigend nach Bundesland 'NRW' sortieren

In [24]:
dfData.sort_values(by = 'NRW')
dfData

Bundesland    NRW  Bayern  Hamburg  Hessen
Jahr
1960        15.85    9.49     1.84    4.78
2000        18.00   12.23     1.72    6.07
2020        17.93   13.14     1.85    0.00

In [25]:
# Ausgabe des DataFrames
print("\n{}".format(dfData))

### Ende Aufgabe_03_2.ipynb ###

Bundesland    NRW  Bayern  Hamburg  Hessen
Jahr
1960        15.85    9.49     1.84    4.78
2000        18.00   12.23     1.72    6.07
2020        17.93   13.14     1.85    0.00